#language: ru

  Функционал: домашнее задание по яндекс-маркету

    Сценарий: сценарий №1

      Когда выбрали раздел телевизоры
      И зашли в расширенный поиск

      Тогда задали параметр поиска от 20000 рублей
      И выбрали производителей Samsung и LG
      И нажали кнопку Применить

      Когда проверили что элементов на странице 12
      Тогда запомнили первый элемент в списке

      Когда в поиск ввели запомненное начение
      Тогда убедились, что наименование товара соответствует запомненному значению


    Сценарий: сценарий №2

      Когда выбрали раздел Наушники
      И зашли в расширенный поиск

      Тогда задали параметр поиска от 5000 рублей
      И выбрали производителя Beats
      И нажали кнопку Применить

      Когда проверили, что элементов на странице 12
      Тогда запомнили первый эелемент в списке

      Когда в поиск ввели запомненное значение
      Тогда убедились, что наименование товара соответствует запомненному значению