#language: ru

  Функционал: домашнее задание по яндекс-маркету

    Сценарий: сценарий №1

      Когда Перешли на Яндекс.Маркет
      И Выбрали раздел "Телевизоры"
      И Перешли в расширенный поиск

      Тогда Задали минимальную цену "20000" рублей
      И Выбрали производителя "Samsung"
      И Выбрали производителя "LG"
      И Нажали кнопку применить
      И Проверили что элементов на странице "48"
      И Запомнили первый элемент

      Когда Ввели название первого элемента в поиск

      Тогда Проверили что результат поиска совпадает с запомненным значением

    Сценарий: сценарий №2

      Когда Перешли на Яндекс.Маркет
      И Выбрали раздел "Наушники"
      И Перешли в расширенный поиск

      Тогда Задали минимальную цену "5000" рублей
      И Выбрали производителя "Beats"
      И Нажали кнопку применить
      И Проверили что элементов на странице "48"
      И Запомнили первый элемент

      Когда Ввели название первого элемента в поиск

      Тогда Проверили что результат поиска совпадает с запомненным значением
